Repository: os01ri/MealMate
Catalog: lib/core/localization/app_*.arb
Languages: ar

# addedToCart
source: added to cart successfully
ar: تم إضافة العنصرإلى السلة

source: + Add New Ingredient
ar: + إضافة مكون جديد

source: Add New Step
ar: أضافة خطوة جديدة

source: Add Step
ar: إضافة الخطوة

source: Add To Cart
ar: إضافة إلى السلة

# addValidUsername
source: please enter a valid username
ar: الرجاء إدخال اسم مستخدم صالح

source: All
ar: الكل

source: Are You Sure
ar: هل أنت متأكد

source: By continuing you agree to the
ar: بالمتابعة فإنك توافق على

source: cancel
ar: الخروج

source: Categories
ar: الفئات

source: Change Email
ar: تغير الايميل

source: Code Not Sent ?
ar: لم تستلم رمز ؟

source: Confirm Password
ar: تأكيد كلمة المرور

source: Congrats on finishing th recipe
ar: تهانينا لنهاءك طبخ الوصفة

# createAccount
source: Create an Account
ar: إنشاء حساب

source: Create recipe
ar: إنشاء وصفة

source: Description
ar: الوصف

# dontHaveAccount
source: Don't Have an account? Sign Up
ar: ليس لديك حساب؟ إنشاء حساب

# email
source: E-mail Address
ar: الإيميل

# enterEmail
source: Enter E-mail Address
ar: أدخل الإيميل

# enterEmailToResetPassword
source: Enter Your E-mail Address And We Will Send You A Link To Reset Your Password
ar: قم بإدخال عنوان بريدك الإلكتروني، سنرسل لك رابطاً لإعادة ضبط كلمة المرور

# enterNewPassword
source: Please Enter A New Password
ar: أدخل كلمة المرور الجديدة

source: Enter OTP Code
ar: أدخل رمز التأكيد

# enterValidEmail
source: please add a valid email
ar: أدخل عنوان إيميل صحيح

# enterValidPassword
source: Enter a valid password
ar: أدخل كلمة مرور صالحة

# error
source: something went wrong
ar: حدث خطأ ما

source: Finish Cooking
ar: إنهاء التحضير

source: first name
ar: الاسم الأول

source: followers
ar: متابع

source: following
ar: تتابع

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Get Started
ar: ابدأ

source: Go To Home
ar: العودة للصفحة الرئيسية

source: Grocery Store
ar: المتجر

source: Hello
ar: مرحباً

source: Ingredients
ar: المكونات

# languageValue
source: English Language
ar: اللغة العربية

source: last name
ar: الاسم الأخير

source: Login
ar: تسجيل الدخول

source: Log Out
ar: تسجيل الخروج

source: min
ar: د

source: Most Rated
ar: الأعلى تقييما

# newRecipes
source: Newest Recipes
ar: أحدث الوصفات

source: Next
ar: التالي

source: No
ar: لا

source: No Ingredients
ar: لايوجد عناصر

source: No Items In Wishlist
ar: لا يوجد عناصر

source: Nutritional Info
ar: المعلومات الغذائية

# onboardingDescription1
source: Order the ingredients you need quickly with a fast process
ar: اطلب المكونات التي تحتاجها بسرعة وسهولة

# onboardingDescription2
source: Cooking based on the food recipes you find and the food you love
ar: قم بتحضير الوصفات التي تناسبك من خلال نظام التوصيات الخاص!

# onboardingDescription3
source: 5000+ healthy recipes made by people for your healthy life
ar: نقدم لك عدد كبير من الوصفات من مختلف الثقافات والفئات!

# onboardingTitle1
source: Order Ingredients You Wants!
ar: اطلب المكونات الغذائية التي تحتاجها

# onboardingTitle2
source: Let's Cooking
ar: لنبدأ التحضير!

# onboardingTitle3
source: All recipes you needed
ar: جميع الوصفات!

source: or continue with
ar: أو المتابعة بـ

source: or Login
ar: أو تسجيل الدخول

source: Password
ar: كلمة المرور

# passwordNotMatch
source: password doesn't match
ar: كلمتا السر غير متطابقتان

source: Place Order
ar: إرسال الطلب

source: Please Add A Valid Step Description
ar: الرجاء اضافة شرح مناسب لهذه الخطوة

source: Please Add A Valid Time
ar: الرجاء اضافة وقت مناسب

source: Please Add Recipe Description
ar: الرجاء ادخال شرح الوصفة

source: Please Add Recipe Name
ar: الرجاء ادهال اسم للوصفة

source: Please Add Valid Step Name
ar: الرجاء اضافة اسم خطوة مناسب

source: Please Add Your Address
ar: الرجاء تحديد عنوانك

source: Please Enter UserName
ar: أدخل اسم المستخدم

source: Please Rate Recipe
ar: الرجاء تقييم الوصفة

source: Please Select Category
ar: الرجاء اختيار الفئة

source: Please Select Type
ar: الرجاء اختر النوع

source: Please wait for admin to accept
ar: الرجاء انتظار موافقة الادمن

source: preferences
ar: التفضيلات

source: Previous
ar: السابق

source: Privacy Policy
ar: شروط الخصوصية

source: Publish!
ar: نشر!

source: Recipe Feeds No:
ar: الوجبة تكفي :

source: recipe finished
ar: انتهيت من الطبخ

source: Recipe Name
ar: اسم الوصفة

source: recipes
ar: الوصفات

# recommended
source: Recommended For You
ar: موصى بها لك

# resendCode
source: re-send the code
ar: ارسال الرمز مرة ثانية

source: retry
ar: أعد المحاولة

source: Reviews
ar: مراجعة

# searchIngredients
source: Search Items
ar: البحث عن العناصر

source: Search Recipes
ar: البحث عن وصفة

source: see all
ar: الكل

source: Select Category
ar: اختر الفئة

source: Select Type
ar: اختر النوع

source: Send E-mail
ar: إرسال إيميل

source: Serves
ar: تكفي لـ

source: settings
ar: الإعدادات

source: Shipping Fee
ar: تكلفة التوصيل

source: Sign Up
ar: إنشاء الحساب

source: Skip
ar: تخطي

source: Start Cooking!
ar: ابدأ التحضير!

source: Stay logged in
ar: البقاء قيد تسجيل الدخول

source: Step
ar: الخطوة

source: Step Description
ar: الوصف

source: Step Name
ar: اسم الخطوة

source: Steps
ar: الخطوات

source: Step Time
ar: الوقت المتوقع

source: SYP
ar: ل.س

source: Terms Of Service
ar: شروط الخصوصية

source: There Is No Data
ar: لا يوجد بيانات

source: Time
ar: الوقت

source: Total Payment
ar: الإجمالي

source: Trending
ar: الأكثر طلبَا

source: Username
ar: اسم المستخدم

# welcomeLoading
source: Personalizing Healthy Recipes For Your Healthy Life
ar: يتم تحميل وصفاتك المخصصة

# whatToCook
source: What would you like to cook today?
ar: ماذا تريد أن تحضّر اليوم؟

source: Yes
ar: نعم

source: You Didn't Make Preferences Yet
ar: لم تقم بتحديد تفضيلاتك بعد

source: You Didn't Post Recipe Yet
ar: لم تقم بنشر وصفات بعد

source: Your Interests
ar: اهتماماتك

source: Your Order Is Placed Successfully
ar: تم انشاء طلبك بنجاح

source: Your Recipe Published Successfully!
ar: لقد تم نشر وصفتك بنجاح
